trade_exp/src/Documents/СлужебнаяЗаписка/СлужебнаяЗаписка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="52f1918a-e667-4bbf-a691-9c76e146951a">
  <name>СлужебнаяЗаписка</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="a6bac9e0-b45c-4618-820d-132f122a737c">
    <name>Вид</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="12ab7e5d-1abf-4306-96e8-0133b4da3735">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2a85d255-85d5-4146-8eba-04c37fd852dc">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c69b2ba2-c7a3-4dbb-af2d-1fce7732d522">
    <name>Утверждающий1</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3177c995-dbd0-4f2b-9920-388a2e0ed0ba">
    <name>Утверждающий2</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4662522d-3c43-4a87-88e8-5450d5020c45">
    <name>Утверждающий3</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8b921667-e7c9-44e1-9287-5e3a5fd4c4d0">
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="80ad1474-160e-4bf5-b8ad-a48891e39f4d">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="26a26ddb-42cd-4e5d-9353-d3bef12582f3">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="741fa878-8c41-487d-8093-1d6431b7daf3">
    <name>ЗаСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c9866dac-c2fa-443e-b38c-1c00339595b9">
    <name>ИДБизнесПроцесса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8ddd6528-622a-4284-aba0-7a23d6bb1ffa">
    <name>Утверждающий4</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fe962240-a26d-4fad-b244-c72ae4a3ab6c">
    <name>Утверждающий5</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="bbd84fd9-9e38-4a1d-83ec-eea33e5bf6f8">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="5535536a-9258-4159-a8e1-e732f3a05672">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9bab6f04-9833-4d64-8948-2b704191a2d7">
      <name>НоменклатураОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="729f2688-3afd-4e10-8c22-24e34f4df651">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b3bd4f2a-21ae-4fa6-b33d-28f93fe1271e">
      <name>ХарактеристикаОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="edb8e692-5d71-4789-804e-2590827d4b5c">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1389375a-6056-4aea-adca-331f801f1abf">
      <name>НазначениеОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dcafb42a-e1be-4538-86b0-bb6870876a62">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="1f25ee78-77b4-4fea-8ca1-d4d80b43bbc0">
      <name>КоличествоУпаковокФакт</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="371ca631-23a9-41ff-b820-f614ed61ff2b">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="1ec9e136-49f4-4011-b0ef-26ff7994b6e5">
      <name>ЦенаОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="34afd76b-1dc8-42f6-a2b1-fa4625cfa889">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="dfa7dac4-fd67-43e0-a51f-61a136e4dbfd">
      <name>СуммаОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="781c3ce4-e538-4e6f-80c8-9735d29bd278">
      <name>ПричинаБлокировки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e926fe00-f670-4118-86bf-e23d7ede60f2">
      <name>ПричинаСписания</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="36bce962-837f-464c-93a1-e1fc16ffc3e6">
      <name>Отклонение</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="60763d4a-d91b-4078-bf09-c8cd8a867503">
      <name>Основание</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a0c8f535-e00c-401c-9aaa-994cb0ef95a0">
      <name>ЯПХ</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ba11c8d8-c438-4ed1-a658-46e5f58f561a">
      <name>КоличествоПоУчетуВЗонеХранения</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/БлокировкаДвиженияТоваров/БлокировкаДвиженияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ec36221d-37a4-4c12-9c34-7cb1eceaead1">
  <name>БлокировкаДвиженияТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.РаспределениеЗапасовДвижения</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыИПотребности</registerRecords>
  <attributes extendedConfigurationObject="bcd3b202-1b4b-4cb7-9c80-2a93e9f648db">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8173986d-73df-48fa-9cc8-38cfe45d8748">
    <name>БлокировкаОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5f9d0fad-e42e-4731-8107-06e3f90b212d">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="441ea6d9-ec19-4570-b97b-f8e66ebbde99">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8671922f-e1fb-486a-bbb5-fd960e199e94">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="250a0493-3164-44eb-9b46-4baeac4f1c2c">
    <name>ПричинаБлокировки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c23c42b8-9959-4ace-91a6-5a7cbc2fbb63">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="a9f05fa3-fa19-43ed-95dd-01e6677ecdf1">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="d8f9f1e5-d2cd-4da7-ad72-aefa73478085">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="89a7e0a8-ebb3-4118-ac5f-b614e1a2fac3">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="42ebd587-1a10-4279-b4c1-ce101094cfa4">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="a7742230-e6be-4988-9a70-2b9318d2e6e8">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/СлужебнаяЗаписка/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОграничениеДоступностиОстатков = АльтерраОбщегоНазначения.ПолучитьОграничениеДоступностиОстатков();
	
	РольДоступна = Ложь;
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда 
		Отказ = Истина; 
		Сообщить("Копирование запрещенно"); 
	КонецЕсли;
	
	Если Не ПроверкаРоли() Тогда
		Отказ = Истина; 
		Сообщить("Не достаточно прав для создания документа");
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Ответственный = Пользователи.ТекущийПользователь();
		Объект.Утверждающий1 = РеквизитФормыВЗначение("Объект").ПолучитьРуководителяПользователя(Объект.Ответственный);
		Объект.Статус = "Подготовлено";
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Объект.ЗаСчет) Тогда   
		Элементы.ЗаСчет.ЦветРамки = Новый Цвет(255,0,0);
	КонецЕсли;
	

	Если ТипЗнч(Объект.Товары[0].Основание) = Тип("ДокументСсылка.ПересчетТоваров") И НЕ РольДоступна("ПолныеПрава") Тогда
		Элементы.Товары.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверкаРоли()
	РольДоступна = Пользователи.РолиДоступны("ДобавлениеИзменениеСлужебнойЗаписки");
	Возврат РольДоступна;
КонецФункции 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтобразитьОснования();
	УстановитьВидимостьПоВиду();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьПоВиду()
	
	Для каждого Элемент Из Элементы.Товары.ПодчиненныеЭлементы Цикл
		Элемент.Видимость = Истина;
	КонецЦикла;
	Для каждого Элемент Из Элементы.ГруппаСписываемыйТовар.ПодчиненныеЭлементы Цикл
		Элемент.Видимость = Истина;
	КонецЦикла;
	
	Элементы.ГруппаПриходуемыйТовар.Видимость             = Ложь;
	Элементы.ГруппаСписываемыйТовар.ОтображатьЗаголовок   = Ложь;
	Элементы.ГруппаСписываемыйТовар.ОтображатьВШапке      = Ложь;
	Элементы.Основание.Видимость = Ложь;
	Элементы.Отклонение.Видимость                   = Ложь;
	Элементы.Количество.Видимость                   = Ложь;
	Элементы.ПричинаСписания.Видимость              = Ложь;
	Элементы.КоличествоУпаковок.Заголовок           = "Количество";
	Элементы.Цена.Заголовок                         = "Цена";
	Элементы.Цена.Видимость                         = Ложь;
	Элементы.ЗаполнитьЦеныПоСебестоимости.Видимость = Ложь;
	
	Если Объект.Вид = ПредопределенноеЗначение("Перечисление.ВидыСлужебныхЗаписок.Пересчет") Тогда
		Элементы.Сумма.Видимость                              = Ложь;
		Элементы.КоличествоУпаковок.Заголовок                 = "По учету (весь товар)";
		Элементы.ПричинаБлокировки.Видимость                  = Ложь;
		Элементы.Отклонение.Видимость                         = Истина;
		Элементы.ЯПХ.Видимость                                = Истина;
		Элементы.КоличествоУпаковокПоФакту.Видимость          = Истина;
	ИначеЕсли  
		Объект.Вид = ПредопределенноеЗначение("Перечисление.ВидыСлужебныхЗаписок.Пересорт") Тогда
		Элементы.ГруппаПриходуемыйТовар.Видимость             = Истина;
		Элементы.ГруппаСписываемыйТовар.ОтображатьЗаголовок   = Истина;
		Элементы.ГруппаСписываемыйТовар.ОтображатьВШапке      = Истина;
		Элементы.ЗаполнитьЦеныПоСебестоимости.Видимость       = Истина;
		Элементы.ЦенаПриходуемый.Видимость         		 	  = Ложь;
		Элементы.КоличествоУпаковокПоФакту.Видимость          = Ложь;
		
	Иначе
		Элементы.Цена.Заголовок                               = "Себестоимость ед., руб";
		Элементы.Цена.Видимость                               = Истина;
		Элементы.Количество.Видимость                         = Истина;
		Элементы.ЗаполнитьЦеныПоСебестоимости.Видимость       = Истина;
		Элементы.ЕдиницаИзмерения.Видимость                   = Ложь;
		Элементы.КоличествоУпаковок.Видимость                 = Ложь;
		Элементы.КоличествоУпаковокПоФакту.Видимость          = Ложь;
		Элементы.ПричинаСписания.Видимость                    = Истина;
	КонецЕсли;
	
	РассчитатьПоСтроке();
	УстановитьВидимостьПоРолям();

КонецПроцедуры

Процедура УстановитьВидимостьПоРолям()
	
	Если ОграничениеДоступностиОстатков И Объект.Вид = ПредопределенноеЗначение("Перечисление.ВидыСлужебныхЗаписок.Пересчет") Тогда
		УчетСкрыт = Объект.Товары[0].Основание.УчетСкрыт;
		Если УчетСкрыт Тогда
			ОтображатьОстатки = АльтерраОбщегоНазначения.ЕстьПравоПросмотраОстатков(Пользователи.ТекущийПользователь());
			Элементы.КоличествоУпаковок.Видимость = ОтображатьОстатки;
			Элементы.Отклонение.Видимость = ОтображатьОстатки;
			Элементы.КоличествоПоУчетуВЗонеХранения.Видимость = ОтображатьОстатки;
			Элементы.ЯПХ.Видимость = ОтображатьОстатки;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьПоСтроке()
	
	Если Элементы.Отклонение.Видимость Тогда
		Для каждого Стр Из Объект.Товары Цикл 
			Если ТипЗнч(Стр.Основание) = Тип("ДокументСсылка.ПересчетТоваров") Тогда
				Стр.Отклонение = Документы.ПересчетТоваров.НовыйРасчетОтклонения(Стр, Стр.Основание.НовыйРасчетОтклонения);
			Иначе	
				Стр.Отклонение = Стр.КоличествоУпаковокФакт - Стр.КоличествоУпаковок;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступность(Основание)
	
	Если Объект.ИДБизнесПроцесса <> "" Или Не ПроверкаРоли() Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
		Элементы.ПересчетТоваров.Доступность = Ложь;
		Элементы.БлокировкаДвижения.Доступность = Ложь;
		Элементы.ОтправитьНаСогласование.Доступность = Ложь;
	КонецЕсли;
	
	Если Основание = "БлокировкаДвиженияТоваров" Тогда
		Элементы.Товары.ТолькоПросмотр = Ложь;
		Элементы.Вид.ТолькоПросмотр    = Ложь;
		Элементы.Вид.СписокВыбора.Очистить();
		Элементы.Вид.РежимВыбораИзСписка = Истина;
		ЗначенияВид = Новый Массив;
		ЗначенияВид.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСлужебныхЗаписок.Оприходование"));
		ЗначенияВид.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСлужебныхЗаписок.ПереводВНк"));
		ЗначенияВид.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСлужебныхЗаписок.СписаниеНедостачи"));
		ЗначенияВид.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСлужебныхЗаписок.Пересорт"));
		Элементы.Вид.СписокВыбора.ЗагрузитьЗначения(ЗначенияВид);
	КонецЕсли;
	
	Если Объект.Вид = ПредопределенноеЗначение("Перечисление.ВидыСлужебныхЗаписок.Пересчет") Тогда
		Элементы.Товары.ТолькоПросмотр = Истина;
		Элементы.Вид.ТолькоПросмотр    = Истина;
		Элементы.Вид.РежимВыбораИзСписка = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОснования(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТипДокумента", Команда.Имя);
	
	Если Объект.Товары.Количество() > 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ВыбратьОснованияЗавершение", ЭтотОбъект, ДополнительныеПараметры),
						"Табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ОткрытьФормуВыбора(Команда.Имя);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОснованияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Объект.Товары.Очистить();
		Объект.Исполнитель = Неопределено;
		ОткрытьФормуВыбора(ДополнительныеПараметры.ТипДокумента);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбора(Документ)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	ПараметрыОткрытия.Вставить("ЗакрыватьПриВыборе",Истина);
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма);
	
	Если Документ = "БлокировкаДвиженияТоваров" Тогда
		ПараметрыОткрытия.Вставить("МножественныйВыбор",Истина);
		ОткрытьФорму("Документ.БлокировкаДвиженияТоваров.ФормаСписка", ПараметрыОткрытия, ЭтаФорма,,,, ОбработкаВыбора);
	Иначе
		ПараметрыОткрытия.Вставить("МножественныйВыбор",Ложь);
		ОткрытьФорму("Документ.ПересчетТоваров.ФормаВыбора", ПараметрыОткрытия, ЭтаФорма,,,, ОбработкаВыбора);
	КонецЕсли;
	
	УстановитьДоступность(Документ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыВыбора(Результат, ДопПараметры) Экспорт

    Если Результат = Неопределено Тогда 
        Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("ДокументСсылка.ПересчетТоваров") Тогда
		ЕстьЗаписка = ПроверитьПересчет(Результат);
		Если ЕстьЗаписка = Истина Тогда
			Сообщить("По выбранному документу уже создана служебная записка.");
			Возврат;
		КонецЕсли;
	КонецЕсли; 
	
	ЗаполнитьПоОснованиям(Результат);
	ВидПриИзменении("");
	ОтобразитьОснования();

КонецПроцедуры

&НаСервере
Функция ПроверитьПересчет(Ссылка)
	ЕстьЗаписка = Документы.ПересчетТоваров.ЕстьСлужебнаяЗаписка(Ссылка);
	Возврат ЕстьЗаписка;
КонецФункции

&НаСервере
Процедура ЗаполнитьПоОснованиям(Основания)
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(Основания) = Тип("ДокументСсылка.ПересчетТоваров") Тогда
		Объект.Вид = ПредопределенноеЗначение("Перечисление.ВидыСлужебныхЗаписок.Пересчет");
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПересчетТоваровТовары.Ссылка КАК Основание,
		|	ПересчетТоваровТовары.Количество КАК Количество,
		|	ПересчетТоваровТовары.КоличествоФакт КАК КоличествоФакт,
		|	ПересчетТоваровТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ПересчетТоваровТовары.КоличествоУпаковокФакт КАК КоличествоУпаковокФакт,
		|	ПересчетТоваровТовары.ЯПХ КАК ЯПХ,
		|	ПересчетТоваровТовары.КоличествоПоУчетуВЗонеХранения КАК КоличествоПоУчетуВЗонеХранения,
		|	ПересчетТоваровТовары.Номенклатура КАК Номенклатура,
		|	ПересчетТоваровТовары.Номенклатура.Код КАК Код,
		|	ПересчетТоваровТовары.Упаковка КАК Упаковка,
		|	ПересчетТоваровТовары.Характеристика КАК Характеристика,
		|	ПересчетТоваровТовары.Назначение КАК Назначение,
		|	ПересчетТоваровТовары.Ссылка.Склад КАК Склад
		|ИЗ
		|	Документ.ПересчетТоваров.Товары КАК ПересчетТоваровТовары
		|ГДЕ
		|	ПересчетТоваровТовары.Ссылка = &Основание"
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	БлокировкаДвиженияТоваровТовары.Ссылка КАК Основание,
		|	БлокировкаДвиженияТоваровТовары.Номенклатура КАК Номенклатура,
		|	БлокировкаДвиженияТоваровТовары.Номенклатура.Код КАК Код,
		|	БлокировкаДвиженияТоваровТовары.Характеристика КАК Характеристика,
		|	БлокировкаДвиженияТоваровТовары.Упаковка КАК Упаковка,
		|	БлокировкаДвиженияТоваровТовары.Количество КАК Количество,
		|	БлокировкаДвиженияТоваровТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	БлокировкаДвиженияТоваровТовары.Ссылка.ПричинаБлокировки.Ссылка КАК ПричинаБлокировки,
		|	БлокировкаДвиженияТоваровТовары.Ссылка.Склад КАК Склад
		|ИЗ
		|	Документ.БлокировкаДвиженияТоваров.Товары КАК БлокировкаДвиженияТоваровТовары
		|ГДЕ
		|	БлокировкаДвиженияТоваровТовары.Ссылка В(&Основание)";
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("Основание", Основания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Склады = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Если Склады.Количество() = 0 Тогда
			Склады.Добавить(Выборка.Склад);
		Иначе
			Если Склады.Найти(Выборка.Склад) = Неопределено Тогда 
				Сообщить("Выбранные документы должны быть по одному складу!");
				Объект.Товары.Очистить();
				Прервать;
			КонецЕсли; 
		КонецЕсли; 
		Стр = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(Стр, Выборка);
	КонецЦикла;
	Объект.Склад = Склады[0];
	
	Если ТипЗнч(Основания) = Тип("ДокументСсылка.ПересчетТоваров") Тогда
		Объект.Исполнитель = РеквизитФормыВЗначение("Объект").ПолучитьИсполнителя(Объект.Склад);
	КонецЕсли;
   
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьОснования()
	
	Если Объект.Товары.Количество() = 0 Тогда 
		Основания  = "";
		Возврат;
	КонецЕсли;
	
	ЕстьПересчет = Ложь;
	МассивОснований = Новый Массив;
	Для каждого Стр Из Объект.Товары Цикл
		Если МассивОснований.Найти(Стр.Основание) = Неопределено Тогда
			МассивОснований.Добавить(Стр.Основание);  
			
			Если ТипЗнч(Стр.Основание) = Тип("ДокументСсылка.ПересчетТоваров") Тогда
				ЕстьПересчет = Истина;
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла;
	
	МассивСтрок = Новый Массив;
	Для каждого СтрМассивОснований Из МассивОснований Цикл
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(Строка(СтрМассивОснований),,,, ПолучитьНавигационнуюСсылку(СтрМассивОснований)));
	    МассивСтрок.Добавить(Символы.ПС);
	КонецЦикла; 
	
	МассивСтрок.Удалить(МассивСтрок.Количество() - 1);
	Основания = Новый ФорматированнаяСтрока(МассивСтрок);
	Элементы.Основания.МаксимальнаяВысота = МассивСтрок.Количество() - 1;
	Элементы.Основания.Высота = МассивСтрок.Количество() - 1;
	Элементы.ГруппаОснования.Высота = МассивСтрок.Количество() - 1;
	Элементы.ЯПХ.Видимость = ЕстьПересчет;
	Элементы.КоличествоПоУчетуВЗонеХранения.Видимость = ЕстьПересчет;
КонецПроцедуры

&НаКлиенте
Процедура ВидПриИзменении(Элемент)
	УстановитьВидимостьПоВиду();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	ОтобразитьОснования();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
		Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦеныПоСебестоимости(Команда)
	
	ОчиститьСообщения();
	Если Объект.Товары.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='В документе не заполнена таблица ""Товары"". Цены не могут быть заполнены'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Товары", "Объект");		
		Возврат;
	КонецЕсли;
	ЗаполнитьЦеныПоСебестоимостиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦеныПоСебестоимостиНаСервере()
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Дата", ТекущаяДата());
	ПараметрыЗаполнения.Вставить("Организация", Справочники.Организации.НайтиПоНаименованию("Альтерра ООО"));
	ПараметрыЗаполнения.Вставить("Валюта", Справочники.Валюты.НайтиПоНаименованию("руб"));
	ПараметрыЗаполнения.Вставить("Склад", Объект.Склад);
	
	ПродажиСервер.ЗаполнитьЦеныПоСебестоимости(
	Объект.Товары, // Табличная часть
	Неопределено, // Выделенные строки (заполнять во всех строках)
	ПараметрыЗаполнения);
	
	Если Элементы.ГруппаПриходуемыйТовар.Видимость = Истина Тогда
		НоменклатураОприходование = Объект.Товары.Выгрузить(, "НомерСтроки,НоменклатураОприходование, ХарактеристикаОприходование, НазначениеОприходование");
		НоменклатураОприходование.Колонки.Добавить("Цена");
		ДругиеИменаКолонок = Новый Структура("НоменклатураОприходование, ХарактеристикаОприходование, НазначениеОприходование", "Номенклатура", "Характеристика", "Назначение");
		ПараметрыЗаполнения.Вставить("ДругиеИменаКолонок", ДругиеИменаКолонок);
		
		ПродажиСервер.ЗаполнитьЦеныПоСебестоимости(
		НоменклатураОприходование, // Табличная часть
		Неопределено, // Выделенные строки (заполнять во всех строках)
		ПараметрыЗаполнения);
	КонецЕсли; 
	
	Для каждого Стр Из Объект.Товары Цикл
		Стр.Сумма = Стр.КоличествоУпаковок * Стр.Цена;
		Если Элементы.ГруппаПриходуемыйТовар.Видимость = Истина Тогда
			Для каждого СтрокаТЗ Из НоменклатураОприходование Цикл
				Если Стр.НоменклатураОприходование = СтрокаТЗ.НоменклатураОприходование Тогда
					Стр.ЦенаОприходование = СтрокаТЗ.Цена;
				КонецЕсли; 
			КонецЦикла; 
		Стр.СуммаОприходование = Стр.КоличествоУпаковок * Стр.ЦенаОприходование;
		КонецЕсли;
	КонецЦикла;
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНаСогласование(Команда)
	Если Объект.ИДБизнесПроцесса = "" Тогда
		Элементы.ОтправитьНаСогласование.Доступность = Ложь;
		ПоказатьВопрос(Новый ОписаниеОповещения("ОтправитьНаСогласованиеЗавершение", ЭтотОбъект),
							"Документ будет сохранен, дальнейшее изменение будет невозможно. Продолжить?", РежимДиалогаВопрос.ДаНет);  
	Иначе
		Сообщить("Эта служебная записка уже была отправлена на согласование");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНаСогласованиеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Попытка
			Записать(Новый Структура("РежимЗаписи",РежимЗаписиДокумента.Проведение));
			ОтправитьНаСогласованиеНаСервере();
		Исключение
			Ошибка = ИнформацияОбОшибке();
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = КраткоеПредставлениеОшибки(Ошибка);
			Сообщение.Сообщить();
			ТекстОшибки = ПодробноеПредставлениеОшибки(Ошибка);
		КонецПопытки;
		ЭтаФорма.Прочитать();
		УстановитьДоступность(Неопределено);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСогласованиеНаСервере()
	Документы.СлужебнаяЗаписка.ОтправитьНаСогласованиеСлужебнуюЗаписку(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ЗаСчетПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(Объект.ЗаСчет) Тогда   
		Элементы.ЗаСчет.ЦветРамки = Новый Цвет(255,0,0); 
	Иначе
		Элементы.ЗаСчет.ЦветРамки = Новый Цвет(160,160,160);
	КонецЕсли;
КонецПроцедуры
